app/controllers/memberships_controller.rb

SELECT "services".* FROM "services"  ORDER BY "services"."name" ASC
---
    def set_combo_values
      @services = Service.all.order(:name)