app/controllers/products_controller.rb

INSERT INTO "products" ("name", "purchase_price", "sale_price", "quantity", "minimun_quantity", "provider_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "name" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["name", "Agua de Coco"], ["updated_at", "2017-12-13 20:44:09.382761"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)

SELECT "providers".* FROM "providers"  ORDER BY "providers"."name" ASC
---
    def set_combo_values
      @providers = Provider.all.order(:name)