app/controllers/providers_controller.rb

  def create
    @provider = Provider.new(provider_params)

    respond_to do |format|
      if @provider.save
---
INSERT INTO "providers" ("name", "ruc", "phone", "address", "email", "state", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def set_provider
      @provider = Provider.find(params[:id])
---
SELECT  "providers".* FROM "providers" WHERE "providers"."id" = $1 LIMIT 1  [["id", 1]]