app/controllers/services_controller.rb

INSERT INTO "services" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "clases Crossfit"], ["description", "clases normales de crossfit"], ["created_at", "2017-12-15 00:21:16.171886"], ["updated_at", "2017-12-15 00:21:16.171886"]]
---
  def create
    @service = Service.new(service_params)

    respond_to do |format|
      if @service.save

SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_service
      @service = Service.find(params[:id])